<template>
  <div class="theme">
    <Background v-model:snowStatus="show" />
    <p>
      “追啊，弟兄们，谁拿下洛豪这个叛徒的脑袋，谁就能获得宗门给的聚真丹奖励。”
      一个长相俊俏的男子，颇有一番翩翩公子气概，然而此时他的脸色却狰狞不堪，他正全力施展气息，往前方奔跑。
      他的身后跟着数十人，统一的青色修士服，也都全力飞速前进。
      在这些人前方数里处，一个浑身沾满血迹的人正竭尽全力的往前奔走，只是他的速度相对于身后的追杀的人来说却是慢的如同蜗牛。
      这样下去，不过四五分钟的时间，他就会被身后的人追到，而等待他的将是地狱。
      他的脸色苍白如纸，但是他依然咬牙坚持着，因为他已经逃离出了正阳剑宗的势力范围，他就是俊俏男子口中的洛豪。
      前方二百米是正阳剑宗外围的一座峻峭的险峰，所以这里没有任何出路，有的只是万丈深渊。
      而洛豪本是正阳剑宗一名正式弟子，他的师父是正阳剑宗十大成丹长老之一，可惜正阳剑宗发生内斗，副宗主李强不知怎么突破了成丹实力，
      成为了正阳剑宗除了聚婴初期巅峰实力的宗主狄正阳之外的唯一聚婴高手。副宗主李强暗算了宗主狄正宗之后，便成为了正阳剑宗的宗主，李强心狠手辣，把不服他并且还是支持狄正阳的五大成丹长老悉数杀害，这其中也包括他的师父狄正阳。因为有师父狄正阳的指点，洛豪还是逃出了正阳剑宗，不过却也被李强打成重伤，如果不是他的师父狄正阳替他挡了李强的一掌，他现在早已经去见阎王爷了。
      洛豪记住了师父狄正阳跟他说的路线，并且将自己易容，一路奔逃了两天时间，加上师父给他一颗回血丹，他才伤好，并且逃出了李强的眼线。
      师父临死之前，让他往正阳剑宗的外围逃走，也就是无路可走的悬崖，因为师父告诉他，悬崖下面是一条河流，至于流向哪里，师父也没有跟他说清楚。
      只是洛豪万万没想到自己的运气那么背，就在他逃走的时候被李强的亲传弟子李彦龙，也是李强的亲侄子发现，李彦龙带着一群结真后期实力的手下围住了他，而他只有结真中期实力，如果不是李彦龙的手下大意，加上自己的实力也可以媲美结真后期，他甚至都不能逃出李彦龙和他手下的围堵。
      洛豪是拼着重伤，甚至自爆掉了自己的下品攻击灵器，才能杀出了重围，逃向悬崖。
      但就算是这样，李彦龙也还是追了上来，尽管李彦龙没有受伤，只是他的手下却死了三个，重伤了五个，而且实力还都是结真后期，这也是李彦龙面目狰狞的原因。
      本来他觉得在他的围堵下，洛豪已经是强弩之末，随时都能击杀的小角色，但是他没有想到洛豪暴露了自己的底牌，居然冲破了他的围堵，这让他十分的愤怒。
      所以李彦龙不惜一切代价也要抓到洛豪，他要把洛豪剥皮抽筋，才能泄愤。
      虽然只有二百米的距离，而且还有四五分钟的时间会被李彦龙抓住，但是这对洛豪来说足够了，不过为了以防万一，
      洛豪再次往身后的李彦龙等人扔出了自己身上的唯一一颗迷烟丹。迷烟丹并不会对李彦龙等人造成伤害，因为迷烟丹主要是释放出烟雾，
      迷惑敌人的眼线十多分钟的时间，所以用来阻拦李彦龙等人的前进路线已经足够了。
      洛豪已经不指望自己现在能够杀了李彦龙等人，何况杀了李彦龙等人说不定还会引来李强的追杀，到时候，他更加在劫难逃。
      只听“噗嗤噗嗤”的声音响起，烟雾弥漫了整个道路，李彦龙等人都被突如其来的烟雾给惊住了，以为是洛豪弄出来的毒雾，李彦龙和他的手下都纷纷往后退走，
      这一退走，也拉开了与洛豪之间的距离，而洛豪也趁此机会，赶紧往前冲。
      五分钟之后，洛豪终于到达了悬崖边，洛豪甚至来不及思考，二话不说就跳下了悬崖，因为对洛豪来说，除了跳崖，他别无他法。
      身边传来呼呼的风啸声，洛豪甚至闭上了眼睛，任由自己快速的落下。
      十分钟过去了，洛豪已经到了悬崖底，而悬崖底也果真如他的师父狄正阳所说，是一条河流，只听扑通一声，洛豪径直落入河中，然后任由河水冲走了自己。
      悬崖上，等到烟雾散去之后，李彦龙等人才快速的追向了悬崖边，只是等他们到达时，悬崖边已经没有了洛豪的踪影，李彦龙的脸色十分的难看，
      他并不知道悬崖下方是一条河流，就是李强也不知道悬崖下方是一条河流。
      “龙少，这小子从这么高的悬崖跳下去，恐怕已经粉身碎骨了。”
      李彦龙虽然有些气愤没有亲自将洛豪剥皮抽筋，不过听到手下这么一说，又觉得这悬崖这么高，洛豪跳下去铁定粉身碎骨，也就脸色缓和了一些，
      尽管如此脸色还是有些阴沉，“算了，这小子命好，没有落在我手中，不然我一定让他求生不得求死不能。就这么让他死了还真是便宜他了。我们回去吧。”
      李彦龙说完手一挥，招呼大家回正阳剑宗，然后众人便回了正阳剑宗。
      正阳剑宗，李强听到侄儿李彦龙的禀报，挥了挥手，也并没有将洛豪的事情放在心上，在李强看来，洛豪不过是一个蝼蚁而已，不值得他大张旗鼓的对付，
      何况从那么高的悬崖跳下去，就算是他这个聚婴高手，也会粉身碎骨，何况是结真期还没有成丹的洛豪呢，
      李强现在唯一的想法就是尽快掌控正阳剑宗，毕竟才刚清理了一些正阳剑宗顽固势力耗费了他的不少精力，也让正阳剑宗的整体实力下降了不少。
      再加上一年一度的宗门大比也快要到来了，李强还得精心挑选正阳剑宗的精英弟子，争取在宗门大比中夺得优异的成绩。
      洛豪这种小喽啰就更加不被李强放在心上了，但李强不知道的是，正是他的轻视也注定了他的以后的结局。
    </p>
    <p>
      洛豪落入河中，就已经昏迷了。随着河流一直飘荡了十天十夜，洛豪漂流到了一座小岛的岸边。天气正好，太阳当空正照，宁静的河面忽然被一道声音打破。
      "师姐，快看岸边是不是有什么东西？"一个大约十三四岁的小女孩，有些惊异的指着一个方向，询问身边正在采摘药草的一位妙龄女子。
      这个妙龄女子穿着比较朴素的衣服，俨然一副村姑样。但看她的五官精致，也是一个不错的美人。如果再加打扮的话，就像一位婀娜多姿的仙女。此刻她正低头采摘地上的一种青色的小草。她的一只手臂上挂着一个篮子，篮子里面也装了不少青色的小草。身边是一处草原，到处长满了青色的小草。听到身边小女孩的问话，往小女孩指的方向看了一眼，由于距离太远，只看到一个模糊的影子，那正是昏迷过去的洛豪。
      放下了手中的篮子，女子跟着小女孩来到了洛豪的身边。
      经过河水的冲刷，洛豪身上的血迹已经被冲刷掉。黑色的修士服十分潮湿，脸色也苍白不堪，如果不是还有轻微的心跳声，甚至会让人以为他已经死了。
      "师姐，这位大哥哥是不是已经死了？"小女孩怯怯的询问。
      妙龄女子没有回答小女孩的话，微微皱了皱眉，便放下了手中的篮子，有些吃力的将洛豪给扶了起来。
      "师妹，将篮子拿着，我扶这位大哥哥，咱们一起回家。这位大哥哥受伤了，需要赶紧治疗。"
      "嗯。"小女孩点了点头，拿起了篮子。
      吃力的扶着洛豪走了足足四个小时的路才回到了家，这是一间十分简陋的茅草小屋，但里面却收拾的整整齐齐，小屋中间摆放着一张木床，女子小心翼翼的将洛豪扶到了床边，然后将洛豪放到了床上。然后转身对小女孩说:"师妹，赶快倒点水来。"
      小女孩撇了撇嘴，然后转身去接水了。
      洛豪醒来的时候，已经是第二天了。洛豪起床看到周围的环境，有些愣神。他身上的衣服也已经被换了，是一件很普通的布袍。而且这陌生的环境让洛豪有些不适应。起床走了走，身上的伤势也好的差不多了。正当洛豪要出门时，妙龄女子端着一碗药出现了，两人对视一眼，气氛突然安静。
      妙龄女子脸色泛起一阵红晕，然后柔声说:"你怎么起来了，你的伤还没有痊愈，赶紧躺下吧。"
      洛豪这才回过神来，有些尴尬的回复:"对不起，刚刚有些唐突了，谢谢你救了我。我的伤已经好的差不多了，不能就这么躺着，还是起来走走要好一点。"
      "不用，不用谢。"女子有些腼腆的回应。然后又是一阵宁静。
      这时候，洛豪的肚子忽然响了一声，洛豪有些尴尬的摸了摸头。
      女子啊了一声，十分抱歉的说,"抱歉，我这就去准备饭菜。你先把这碗药喝了吧！"说完将药放在一边的桌子上，急急忙忙的溜了。
      洛豪苦笑一声，有些窘迫。他翻了翻身上，发现自己的储物袋还没有丢，松了一口气，因为这个东西在修真界可以说是无价之宝。是师傅狄正阳留给他的，里面有很多修炼资源。当然，洛豪其实是想找一样东西送给那名女子，用来感谢。翻了翻储物袋，洛豪发现了一个下品防御灵器，表面上看起来就是一个项链。但能够防御结真后期高手的全力一击。如果是结真初期的修真者，甚至可以防御十次。洛豪觉得这个东西还不错，因为对于他来说，这个下品防御灵器作用不大。当然最重要的是，洛豪发现自己只有一些灵器能够拿来报答了，因为丹药已经被他用完了，他现在俨然是一个乞丐了。
      "大哥哥，你醒了就赶紧出来吃饭。"这时候一个小女孩出现，软软的声音却吓了洛豪一跳。小女孩其实有些莫名其妙，因为本来是师姐来叫洛豪的，但是她发现师姐有些不好意思，所以她就来了，但是她的语气有些让洛豪郁闷，这感觉就好像欠了她什么东西一样，尽管洛豪确认自己没有得罪过这个小女孩。但还是跟着这个小女孩出去了。
      饭菜都很简单，都是普普通通的农民家常菜，但是量有点多。洛豪已经十多天没吃饭了，早已经饿的前胸贴后背了。一坐下，开始的时候还有些拘谨，经过女子一声开动之后，便狼吞虎咽起来，惊呆了女子和小女孩。
      "霜师妹，你人在吗?"这时候，屋外忽然传来一阵脚步声，一个黑发青年缓缓走了进来，看到正在桌上狼吞虎咽的洛豪先是一愣，然后便是勃然大怒。指着洛豪质问女子，"霜师妹，这个男人是谁？他为什么会在这里？"
      女子看到忽然进来的黑发青年也是一愣，竟然忘记了回答。倒是一旁的小女孩有些生气，"向师兄，你装什么大尾巴狼呢？我师姐请这个大哥哥吃饭碍着你什么呢？"
      黑发青年脸色渐渐平静下来了，他看了霜师妹一眼，并没有回答小女孩，但是心里早已经把洛豪看成了死人。洛豪居然敢染指他看上的女人，他绝对不会放过洛豪的。只不过现在霜师妹在场，他不好发作。要是和洛豪单独一个地方，他早就已经动手了。气氛忽然有些尴尬。黑发青年一脸平静的走了，来的快，离开的也快。
      等黑发青年离开之后，被叫做霜师妹的女子脸上渐渐的有了些忧色，"那个不好意思，你吃了饭还是离开这里吧，你在我这里，恐怕会惹怒向师兄的。他这人有些阴毒，所以我怕你受到他的伤害。"
      洛豪打了一声饱嗝，诺诺点头，"好的，我会离开的，打搅这位姐姐这么多天真的不好意思，我也没有什么东西可以回报的，这是我送给你的一个东西，是一个下品防御灵器，可以防御结真后期修真者的全力一击，非常感谢你，吃完了这顿，我会离开的。"洛豪忽然掏出一条项链，然后递给了女子。
      至于黑发青年的愤怒，洛豪也察觉到了，而且黑发青年的实力也不简单，比洛豪也要高一个等级，为结真后期。所以为了不麻烦女子，就是女子不说，洛豪也准备离开了，经过这几天的调养，洛豪的伤也好的七七八八了，此时也正是离开的好机会。
      女子摇了摇头，并没有接下洛豪的项链，倒是一旁的小女孩手快速的伸出，将项链从洛豪的手中拿了过来，有些得意，"还算大哥哥你有良心，知道我师姐对你好，送我师姐一个项链，我师姐不好意思，那我就代我师姐勉为其难的收下了。"
      "小倩，快把项链还给他。"女子脸色有些不愉。
      洛豪微笑着摇了摇头,"没事的，那我这就离开了，再见。"说完,洛豪便转身离开了。
      "那个，你先等一下。这里有些盘缠和食物，想来你是第一次来到中洲，应该没有钱，拿着用吧。"女子忽然叫住了洛豪，然后将早已准备好的包袱递给了洛豪。
      洛豪有些苦笑，并没有接下包袱，"这个就不用了，谢谢你。我用不到这些的。对了，你说这里是中洲，我想问一下有没有中洲的地图信息呢？"
      女子点了点头，"这个包袱里面有地图信息，我猜测你应该不是中洲人，所以早就给你准备好了。"
      洛豪接过包袱，深深鞠了一躬，"谢谢你，我叫洛豪，来自北洲的正阳剑宗，我想知道你叫什么名字，大恩不言谢，这份恩情我将铭记在心，以后定当相报。"
      "我叫王小霜。"王小霜有些羞赧。
      洛豪一离开，就感觉到了有人在跟踪他，不用多想，洛豪也知道是之前的那个黑发青年，感受到来者不善，洛豪加快了速度，他在中洲无依无靠，人生地不熟的，以后也只能靠自己来修炼了，那个黑发青年一看就知道是一个背景强大的男子。他也不想得罪任何势力，因为他还有血海深仇没有报。
      尽管洛豪加快了速度，但是对方的速度显然不比洛豪慢，甚至还比洛豪快一点，要不是此地距离王小霜住的地方还有点近，黑发青年甚至都能追上洛豪了，感受到强烈的危机，洛豪的速度身法提升到了极致，朝一处森林极速飞奔而去。
      跟踪着洛豪的黑发青年一看洛豪加快了速度，也提升了身法，加快了速度，他也有些暗暗吃惊，要知道他的实力比洛豪还要高一个等级，在小霜师妹的家里他就看出了洛豪的实力只有结真中期，比他低一个等级，所以对于拿下洛豪，他是一点也不会怀疑的，但是现在感受到洛豪不比他快的速度，他也有些吃惊了，不过这也更加坚定了他要杀了洛豪的决心，因为洛豪一看就不是一个简单的人物，假以时日给他成长，说不定比他还要厉害，只有此时将洛豪扼杀，才能避免这个祸害成长。
      洛豪心里暗暗叫苦，还是实力不行啊，他已经全力逃走了，依然甩不掉身后的人，此人实力强劲，恐怕他不是对手，如果甩不掉，他必死路一条。
    </p>
    <ToTop />
  </div>
</template>

<script>
import { onMounted, reactive, toRefs } from "vue";
import Background from "./views/Background/Background.vue";
import ToTop from "./components/ToTop.vue";
export default {
  components: {
    Background,
    ToTop,
  },
  setup() {
    const state = reactive({
      show: false,
    });
    return {
      ...toRefs(state),
    };
  },
};
</script>

<style lang="less">
@percent: 100%;
.wh-p {
  width: @percent;
  height: @percent;
}
.app {
  .wh-p;
  .theme {
    .wh-p;
  }
}
</style>